ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/GPIOA_1.0.xml
    <register id="GPIOA_DIN3_0" width="32" offset="0x1300" description="Data input 3 to 0">
        <bitfield id="DIO0" description="This bit reads the data input value of DIO0." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO1" description="This bit reads the data input value of DIO1." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO2" description="This bit reads the data input value of DIO2." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO3" description="This bit reads the data input value of DIO3." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="GPIOA_DIN7_4" width="32" offset="0x1304" description="Data input 7 to 4">
        <bitfield id="DIO4" description="This bit reads the data input value of DIO4." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO5" description="This bit reads the data input value of DIO5." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO6" description="This bit reads the data input value of DIO6." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO7" description="This bit reads the data input value of DIO7." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="GPIOA_DIN11_8" width="32" offset="0x1308" description="Data input 11 to 8">
        <bitfield id="DIO8" description="This bit reads the data input value of DIO8." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO9" description="This bit reads the data input value of DIO9." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO10" description="This bit reads the data input value of DIO10." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO11" description="This bit reads the data input value of DIO11." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="GPIOA_DIN15_12" width="32" offset="0x130C" description="Data input 15 to 12">
        <bitfield id="DIO12" description="This bit reads the data input value of DIO12." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO13" description="This bit reads the data input value of DIO13." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO14" description="This bit reads the data input value of DIO14." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO15" description="This bit reads the data input value of DIO15." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="GPIOA_DIN19_16" width="32" offset="0x1310" description="Data input 19 to 16">
        <bitfield id="DIO16" description="This bit reads the data input value of DIO16." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO17" description="This bit reads the data input value of DIO17." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO18" description="This bit reads the data input value of DIO18." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO19" description="This bit reads the data input value of DIO19." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="GPIOA_DIN23_20" width="32" offset="0x1314" description="Data input 23 to 20">
        <bitfield id="DIO20" description="This bit reads the data input value of DIO20." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO21" description="This bit reads the data input value of DIO21." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO22" description="This bit reads the data input value of DIO22." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO23" description="This bit reads the data input value of DIO23." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="GPIOA_DIN27_24" width="32" offset="0x1318" description="Data input 27 to 24">
        <bitfield id="DIO24" description="This bit reads the data input value of DIO24." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO25" description="This bit reads the data input value of DIO25." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO26" description="This bit reads the data input value of DIO26." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO27" description="This bit reads the data input value of DIO27." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="GPIOA_DIN31_28" width="32" offset="0x131C" description="Data input 31 to 28">
        <bitfield id="DIO28" description="This bit reads the data input value of DIO28." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO29" description="This bit reads the data input value of DIO29." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO30" description="This bit reads the data input value of DIO30." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO31" description="This bit reads the data input value of DIO31." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
    <register id="GPIOA_DIN31_0" width="32" offset="0x1380" description="Data input 31 to 0">
        <bitfield id="DIO0" description="This bit reads the data input value of DIO0." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO1" description="This bit reads the data input value of DIO1." begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO2" description="This bit reads the data input value of DIO2." begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO3" description="This bit reads the data input value of DIO3." begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO4" description="This bit reads the data input value of DIO4." begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO5" description="This bit reads the data input value of DIO5." begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO6" description="This bit reads the data input value of DIO6." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO7" description="This bit reads the data input value of DIO7." begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO8" description="This bit reads the data input value of DIO8." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO9" description="This bit reads the data input value of DIO9." begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO10" description="This bit reads the data input value of DIO10." begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO11" description="This bit reads the data input value of DIO11." begin="11" end="11" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO12" description="This bit reads the data input value of DIO12." begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO13" description="This bit reads the data input value of DIO13." begin="13" end="13" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO14" description="This bit reads the data input value of DIO14." begin="14" end="14" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO15" description="This bit reads the data input value of DIO15." begin="15" end="15" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO16" description="This bit reads the data input value of DIO16." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO17" description="This bit reads the data input value of DIO17." begin="17" end="17" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO18" description="This bit reads the data input value of DIO18." begin="18" end="18" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO19" description="This bit reads the data input value of DIO19." begin="19" end="19" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO20" description="This bit reads the data input value of DIO20." begin="20" end="20" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO21" description="This bit reads the data input value of DIO21." begin="21" end="21" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO22" description="This bit reads the data input value of DIO22." begin="22" end="22" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO23" description="This bit reads the data input value of DIO23." begin="23" end="23" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO24" description="This bit reads the data input value of DIO24." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO25" description="This bit reads the data input value of DIO25." begin="25" end="25" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO26" description="This bit reads the data input value of DIO26." begin="26" end="26" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO27" description="This bit reads the data input value of DIO27." begin="27" end="27" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO28" description="This bit reads the data input value of DIO28." begin="28" end="28" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO29" description="This bit reads the data input value of DIO29." begin="29" end="29" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO30" description="This bit reads the data input value of DIO30." begin="30" end="30" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
        <bitfield id="DIO31" description="This bit reads the data input value of DIO31." begin="31" end="31" width="1" rwaccess="R">
            <bitenum id="ZERO" value="0x0" description="Input value is 0"/>
            <bitenum id="ONE" value="0x1" description="Input value is 1"/>
        </bitfield>
    </register>
